import numpy as np

""" 环境设定
T   1   2   3
 4   5   6   7
 8   9  10  11
12  13  14   T

非终止状态 𝒮 = {1, …, 14}。两个 T 是同一个终止状态。
动作 𝒜 = {上, 下, 左, 右}，转移是确定的；会走出网格的动作让状态保持不变。
每一步转移的奖励都是 −1，直到进入终止状态。
不打折：γ = 1。回合制任务。
策略 π：四个动作各 0.25 的概率。

vπ(s) = E[Gt | St = s] = E[Rt+1 + γGt+1 | St = s] = E[Rt+1 + γvπ(St+1) | St = s] = ∑a π(a|s) ∑s',r p(s', r | s, a) [r + γvπ(s')] = ∑s'[∑r p(s', r | s)] [r(s, s') + γvπ(s')] = ∑s' p(s' | s) [r(s, s') + γvπ(s')]
"""

STATE_SIZE = 14
#       1     2     3     4     5     6     7     8     9     10    11    12    13    14
p_s1 = [0.25, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00]
p_s2 = [0.25, 0.25, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00]
p_s3 = [0.00, 0.25, 0.50, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00]
p_s4 = [0.00, 0.00, 0.00, 0.25, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00]
p_s5 = [0.25, 0.00, 0.00, 0.25, 0.00, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00, 0.00]
p_s6 = [0.00, 0.25, 0.00, 0.00, 0.25, 0.00, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.00]
p_s7 = [0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.25, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00]
p_s8 = [0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.25, 0.25, 0.00, 0.00, 0.25, 0.00, 0.00]
p_s9 = [0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.00, 0.25, 0.00, 0.00, 0.25, 0.00]
p_s10 = [0.00, 0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.00, 0.25, 0.00, 0.00, 0.25]
p_s11 = [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.25, 0.00, 0.00, 0.00]
p_s12 = [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.00, 0.50, 0.25, 0.00]
p_s13 = [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.25, 0.25]
p_s14 = [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.25, 0.00, 0.00, 0.25, 0.25]


P_sn = np.array([p_s1, p_s2, p_s3, p_s4, p_s5, p_s6, p_s7, p_s8, p_s9, p_s10, p_s11, p_s12, p_s13, p_s14])
R_sn = -1.0 * (P_sn != 0)
gama = 1.0
theta = 1e-4

def solve_two_array():
    v_k = np.zeros(STATE_SIZE)
    while True:
        v_k1 = np.zeros(STATE_SIZE)
        for s in range(STATE_SIZE):
            v_k1[s] =np.sum([P_sn[s][s_] * (R_sn[s][s_] + gama * v_k[s_]) for s_ in range(STATE_SIZE)])

        # print(np.max(v_k1 - v_k))
        if np.max(np.abs(v_k1 - v_k)) < theta:
            break
        v_k = v_k1.copy()
    return v_k1

def solve_in_place():
    v_k = np.zeros(STATE_SIZE)
    while True:
        vk_backup = v_k.copy()
        for s in range(STATE_SIZE):
            v_k[s] = np.sum([P_sn[s][s_] * (R_sn[s][s_] + gama * v_k[s_]) for s_ in range(STATE_SIZE)])

        # print(np.max(v_k - vk_backup))
        if np.max(np.abs(v_k - vk_backup)) < theta:
            break
    return v_k


if __name__ == "__main__":
    solution1 = solve_in_place()
    solution2 = solve_two_array()

    print(solution1, solution2)
